In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
from numpy.random import randn

In [2]:
npn = np.nan
ser1 = Series([2,npn,3,npn,5,6,npn,8])
ser1

0    2.0
1    NaN
2    3.0
3    NaN
4    5.0
5    6.0
6    NaN
7    8.0
dtype: float64

In [6]:
ser2 = Series(np.arange(len(ser1)),index=[1,2,4,5,6,8,9],dtype=float)
ser2

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
dtype: float64

In [7]:
# to create a series by selecting a value from ser2 if a value in ser1 is null
Series(np.where(pd.notnull(ser1),ser1,ser2),index=ser1.index)

0    2.0
1    1.0
2    3.0
3    3.0
4    5.0
5    6.0
6    6.0
7    8.0
dtype: float64

In [8]:
# a simple version of this is to use combine_first
ser1.combine_first(ser2) #it prints values of ser1, if it finds null value in ser1, 
# then prints the value in that index from ser2 and any additional ser2 elements

0    2.0
1    1.0
2    3.0
3    3.0
4    5.0
5    6.0
6    6.0
7    8.0
dtype: float64

In [10]:
df1 = DataFrame({'C1':[1,2,npn,4],
                'C2':[5,npn,7,npn],
                'C3':[npn,npn,11,12]})
df1

    C1   C2    C3
0  1.0  5.0   NaN
1  2.0  NaN   NaN
2  NaN  7.0  11.0
3  4.0  NaN  12.0

In [12]:
df2 = DataFrame({'C2':[5,8,7,9],
                'C3': [11,2,4,5],
                'C4':[12,11,13,5]})
df2

   C2  C3  C4
0   5  11  12
1   8   2  11
2   7   4  13
3   9   5   5

In [13]:
df1.combine_first(df2) # fills nan values from df1 with respective values from df2. 
# Any additional elements from df2 are printed(C4)

    C1   C2    C3    C4
0  1.0  5.0  11.0  12.0
1  2.0  8.0   2.0  11.0
2  NaN  7.0  11.0  13.0
3  4.0  9.0  12.0   5.0